Repository: afeik/solar_chatbot
Catalog: chatbot_v_1_1/components/languages/*/LC_MESSAGES/messages.po
Languages: de

source: If you have further questions, contact us:
de: Falls Sie weitere Fragen haben kontaktieren Sie uns gerne:

source: Try Again?
de: Erneut versuchen?

source: <b>Thank you for your valuable contribution to our research project on solar energy!</b>
de: <b>Vielen Dank für Ihren wertvollen Beitrag zu unserem Forschungsprojekt zum Thema Solarenergie!</b>

source: I do not own a Solar System
de: Ich besitze noch keine Solaranlage

source: I already own a Solar System
de: Ich besitze bereits eine Solaranlage

source: <h3>Welcome to the Energy Transition Chatbot!</h3>
de: <h3>Willkommen beim Energiewende-Chatbot!</h3>

source: How would you rate your knowledge about the energy transition?
de: Wie würden Sie Ihr Wissen über die Energiewende einschätzen?

source: I acknowledge that data collected during this session will be securely stored and used solely for research purposes at ETH Zurich.
de: Ich bestätige, dass die während dieser Sitzung gesammelten Daten sicher gespeichert und ausschließlich für Forschungszwecke an der ETH Zürich verwendet werden.

source: Start Chatbot
de: Chatbot Starten

source: Provide Final Feedback
de: Finales Feedback abgeben

source: Your response:
de: Ihre Antwort:

source: Done? Click here to continue.
de: Erledigt? Klicken Sie hier.

source: We value your feedback!
de: Wir schätzen Ihr Feedback!

source: Start a new conversation?
de: Neue Konversation starten?

source: Preparing your conversation ...
de: Ihre Konversation wird vorbereitet ...

source: <h4>AI Summary of your concern:</h4>
de: <h4>KI-Zusammenfassung Ihres Anliegens:</h4>

source: How confident are you that this statement is correct?
de: Wie sicher sind Sie, dass diese Aussage korrekt ist?

source: Submit Initial Rating
de: Erste Bewertung abgeben

source: <b>How helpful was this conversation regarding solar energy? </b>
de: <b>Wie hilfreich war diese Konversation rund um die Solarenergie für Sie?</b>

source: How helpful was this conversation regarding your questions or your general understanding of solar energy technologies?
de: Wie hilfreich war diese Konversation für Ihre Fragen oder Ihr Verständnis rund um die Solarenergie?

source: Submit Final Rating
de: Finale Bewertung abgeben

source: <h4>Switzerland's Energy Transition</h4>
de: <h4>Die Energiewende in der Schweiz</h4>

source: Age Group:
de: Altersgruppe:

source: Select
de: Auswählen

source: Under 18
de: Unter 18

source: 65 and older
de: 65 und älter

source: Prefer not to say
de: Möchte ich nicht angeben

source: Gender:
de: Geschlecht:

source: Male
de: Männlich

source: Female
de: Weiblich

source: other
de: Divers

source: Highest Degree Achieved:
de: Höchster erreichter Abschluss:

source: High School
de: Matura

source: Bachelor's
de: Bachelor

source: Master's
de: Master

source: PhD
de: Promotion

source: Other
de: Anderes

source: **Please describe a concrete concern that you have about the Energy Transition:**
de: **Bitte beschreiben Sie ein konkretes Anliegen, das Sie bezüglich der Energiewende haben:**

source: Please let us know what we can improve:
de: Bitte lassen Sie uns wissen, was wir verbessern können:

source: Submit Feedback
de: Feedback absenden

source: Please enter your feedback.
de: Geben Sie bitte ihr Feedback ein.

source: Feedback successfully submitted.
de: Feedback erfolgreich abgesendet.

source: Submit Statement
de: Anliegen einreichen

source: I'm worried the energy transition will increase electricity bills.
de: Ich befürchte, dass die Energiewende die Stromrechnungen erhöhen wird.

source: I'm concerned about blackouts during the transition period.
de: Ich mache mir Sorgen über Stromausfälle während der Übergangsphase.

source: I fear job losses in traditional energy sectors.
de: Ich fürchte Arbeitsplatzverluste in traditionellen Energiesektoren.

source: I'm worried about environmental impacts of new infrastructure.
de: Ich bin besorgt über die Umweltauswirkungen neuer Infrastrukturen.

source: I feel the transition is moving too fast and disrupting daily life.
de: Ich empfinde, dass der Übergang zu schnell voranschreitet und den Alltag stört.

source: Need inspiration? Click here to see example concerns.
de: Brauchen Sie Inspiration? Klicken Sie hier, um Beispielanliegen zu sehen.

source: Please select your age group.
de: Bitte wählen Sie Ihre Altersgruppe.

source: Please select your gender.
de: Bitte wählen Sie Ihr Geschlecht.

source: Please select your highest degree.
de: Bitte wählen Sie Ihren höchsten Abschluss.

source: Please enter at least
de: Bitte geben Sie mindestens

source: characters. You currently have:
de: Zeichen ein. Sie haben derzeit:

source: characters.
de: Zeichen.
